home-aut/app/controllers/airs_controller.rb

  def index
    @airs = Air.all
    def index

raturn_value = []
data  = []
    Air.all.where("created_at > ?", 1.days.ago).each do |aquarium|
      raturn_value.push (aquarium.temperature)
      data.push([aquarium.created_at.to_date.to_datetime.to_i*1000,aquarium.temperature])
    end
    @startdate = Air.first.created_at




@count = Air.all.count
---
SELECT "airs".* FROM "airs"
SELECT COUNT(*) FROM "airs"

  def destroy
    @air.destroy
---
DELETE FROM "airs" WHERE "airs"."id" = $1  [["id", 1]]

    def set_air
      @air = Air.find(params[:id])
---
SELECT  "airs".* FROM "airs" WHERE "airs"."id" = $1 LIMIT 1  [["id", 1]]